## Data Preparation

This is the first step of the project, to upload and merge all the differet files into a sigle DB that we are going to use in all the stages of the project.


This data is given by my company at the moment so it is confidential and it is anonimzed for this project. There are two files given for each instance we have at the company. 

- File 1:  contains all the table names and the project they belong to
- File 2: contains all the header on each table.

We are going to generate two tables one for the project and another for the headers on the tables. All data is connected by the table IDs so we are going to relate both tables easy.

The first problem I face opening this file is that it has multi separators as delimiter in the csv, so I had to search for a way that allows to open it correctly

This file contains the name of the tables in each app oid and Group_oid. The app oid represents the instance of the tables and the group oid the project that it belongs to. There are some tables that can not belong to any project so at first we are not going to take account of them

In [18]:
! cp /content/drive/MyDrive/'Colab Notebooks'/TFM/Data/lista-colecciones-tele.csv .

In [34]:
! cp /content/drive/MyDrive/'Colab Notebooks'/TFM/Data/lista-campos-colecciones-tele.csv .

In [15]:
import pandas as pd

In [19]:
import re

df = pd.DataFrame()
with open('lista-colecciones-tele.csv') as fobj:
    for line in fobj:
        line_data = re.split(',|,,', line)
        
        df = df.append([line_data])

In [30]:
df.head()

0 App_oid Collection_oid  ...  NaN  NaN
0  103721         296719  ...  NaN  NaN
0  103721         299143  ...  NaN  NaN
0  120326         300168  ...  NaN  NaN
0  120326         300169  ...  NaN  NaN
0  120326         300170  ...  NaN  NaN

[5 rows x 15 columns]

In [26]:
#set first row in the dataframe as header

header = df.iloc[0]

df = df.iloc[1:]

df.columns = header

In [29]:
df.head()

0 App_oid Collection_oid  ...  NaN  NaN
0  103721         296719  ...  NaN  NaN
0  103721         299143  ...  NaN  NaN
0  120326         300168  ...  NaN  NaN
0  120326         300169  ...  NaN  NaN
0  120326         300170  ...  NaN  NaN

[5 rows x 15 columns]

In [44]:
# we create a new shorted dataframe 

columns = ['App_oid', 'Collection_oid', 'Name', 'Group_oid', 'Table']

df_shorted = df[columns]

df_shorted.head()

0 App_oid Collection_oid  ... Group_oid                                Table
0  103721         296719  ...      NULL         TELEFONICAMEDIOS_TEST_296719
0  103721         299143  ...      NULL  TELEFONICAMEDIOS_TEST_SCRIPT_299143
0  120326         300168  ...     0;;\n                                 NULL
0  120326         300169  ...     0;;\n                                 NULL
0  120326         300170  ...     0;;\n                                 NULL

[5 rows x 5 columns]

In [45]:
#we are going to check if we have null values and if yes, how many

df_shorted['Name'].isnull().sum()

#we dont have any null in table name

0

In [46]:
#we search for nulls in app_oid
df_shorted['App_oid'].isnull().sum()

0

In [50]:
#we get the only values in the group_oid column in order to explore it

df_shorted.Group_oid.unique()

array(['NULL', '0;;\n', '299498', '286951', '285781', '280190', '273761',
       '255990', '252502',
       'TELEFONICASYGRIS_D_ALIADOS_FORMULAS_SYS_298548',
       'TELEFONICASYGRIS_D_ALIADOS_INDICADORES_252508',
       'TELEFONICASYGRIS_D_ALIADOS_HISTORICO_AUDITORIAS_255646',
       ' países y períodos (Q2 y Q4)""', '241617', '241499', '232634',
       '221510', 'TELEFONICASYGRIS_ROLES_AUDITORIAS_228873',
       'TELEFONICASYGRIS_USUARIOS_AUDITORIAS_228874', ' producción',
       'TELEFONICASYGRIS_AUDITORIA_202307', ' entregado)""', ' N/A)""',
       'TELEFONICASYGRIS_AUXILIAR_PARA_TRIGGERS_DE_AUDIT_233461',
       '204966', '202886',
       ' tiendas o cualquier otro canal. Se incluyen tambien promociones temporales',
       ' descripción y url pública que confirma la existencia de esos canales.""',
       ' tipo', '202563', '200930', '200673',
       'TELEFONICASYGRIS_ANALISIS_DE_RIESGOS_FINAL_249115',
       'TELEFONICASYGRIS_LISTADO_PROVEEDORES_202306',
       'TELEFONICASYGRIS_EMPRESAS_JURIDICAS_PARA_ANALISI_303586',
       'TELEFONICASYGRIS_R_ENE_SEMESTRE_DE_ESTUDIO_297994', '199295',
       '187602', '187601', '187562', '187187', '187180', '-1',
       'TELEFONICASYGRIS_PRINCIPALES_SERVICIOS_ADJUDICAD_204295',
       '304776', '301477', '296040', '293483', '291920', '280509',
       '274958', '274233', '273960', '273959'], dtype=object)

In [ ]:
# Group oid column should contain IDs not text values so there's something that it is not correct in those values with text we should review these in order to be able to use full values on this table

In [38]:
len(df) #lenght of our dataframe

614

## tables field dataframe

In [37]:
df_campos = pd.DataFrame()
with open('lista-campos-colecciones-tele.csv') as fobj:
    for line in fobj:
        line_data = re.split(',|,,', line)
        
        df_campos = df_campos.append([line_data])

In [39]:
df_campos.head()

        0               1         2       3   ...   18   19   20   21
0  App_oid  Collection_oid  Field_id    Name  ...  NaN  NaN  NaN  NaN
0        0          278023     21803     OB_  ...  NaN  NaN  NaN  NaN
0        0          278023     21804  Region  ...  NaN  NaN  NaN  NaN
0        0          278024     21805     OB_  ...  NaN  NaN  NaN  NaN
0        0          278024     21806  Region  ...  NaN  NaN  NaN  NaN

[5 rows x 22 columns]

In [40]:
#set first row in the dataframe as header

header = df_campos.iloc[0]

df_campos = df_campos.iloc[1:]

df_campos.columns = header

df_campos.head()

0 App_oid Collection_oid Field_id         Name  ...  NaN  NaN  NaN  NaN
0       0         278023    21803          OB_  ...  NaN  NaN  NaN  NaN
0       0         278023    21804       Region  ...  NaN  NaN  NaN  NaN
0       0         278024    21805          OB_  ...  NaN  NaN  NaN  NaN
0       0         278024    21806       Region  ...  NaN  NaN  NaN  NaN
0       0         280650    22414  Localizador  ...  NaN  NaN  NaN  NaN

[5 rows x 22 columns]

In [41]:
#we create a new df with the columns we need only
needed_columns = ['App_oid', 'Collection_oid', 'Field_id','Name' ]

In [42]:
df_campos_shorted = df_campos[needed_columns]

In [43]:
df_campos_shorted.head()

0 App_oid Collection_oid Field_id         Name
0       0         278023    21803          OB_
0       0         278023    21804       Region
0       0         278024    21805          OB_
0       0         278024    21806       Region
0       0         280650    22414  Localizador

In [49]:
len(df_campos_shorted)

4506